app/Http/Controllers/PostulanteController.php

select `fkiduser`, `titulos`, `experiencia`, `con_asignatura`, `disponibilidad`, `congresos`, `educacion`, `publicaciones`, `investigaciones`, `con_profesionales` from `usuarios` where `fkiduser` = 4 limit 1
---
    public function edit(Request $request){
        if(!Auth::check()) {
            return redirect()->route('principal')->with('error',"No tiene permiso para acceder a $request->url()");
        }
        $postulante=DB::table('usuarios')->select(
            'fkiduser',
            'titulos',
            'experiencia',
            'con_asignatura',
            'disponibilidad',
            'congresos',
            'educacion',
            'publicaciones',
            'investigaciones',
            'con_profesionales'
            )->where('fkiduser',auth()->user()->id)->first();