app/Http/Controllers/PublicController.php

select * from `vacantes` limit 2 offset 0
select count(*) as aggregate from `vacantes`
---
    public function index(Request $request){
        if((Auth::check()) && (auth()->user()->privilegio==2)) {
            $universidad= Universidad::where('idUniversidad', session('universidad'))->select()->first();
            $catedras=$universidad->catedras;
            $vacantes=[];
            foreach ($catedras as $c) {
                $vac=$c->vacantes;
                foreach($vac as $v){
                    $vacantes[]=$v;
                }
            }
            return view('principal.index',
            ['vacantes'=>$vacantes, 'universidad'=>$universidad, 'catedras'=>$catedras]);
        }
        // dd(request('search'));
        $vacantes=Vacantes::when(
            request()->has('search'),
            fn ($query)=>$query->where('tituloVacante','like','%'.request('search').'%')
            )
            ->orWhere('descCorta','like','%'.request('search').'%')
            ->paginate(2);