app/Http/Controllers/RegistroController.php

    public function register(RegistroRequest $request){
        $user = User::create($request->validated());
        Usuario::create(['fkiduser'=>$user->id]);
---
insert into `users` (`email`, `password`, `nombre`, `apellido`, `direccion`, `privilegio`, `telefono`, `tipodoc`, `ndoc`, `updated_at`, `created_at`) values ('messi@gmail.com', '$2y$10$LSfV21wjm61eSO8RUw9a/O2nPgj/IOeWa6phT3ce4Iux3bXATUvgO', 'Juan', 'Lopez', 'Messi', '1', '32154312', 'DNI', '12354312', '2023-02-06 13:41:02', '2023-02-06 13:41:02')
insert into `usuarios` (`fkiduser`, `updated_at`, `created_at`) values (4, '2023-02-06 13:41:02', '2023-02-06 13:41:02')