app/Http/Controllers/VacanteController.php

select * from `vacantes` where `idVacante` = 1 limit 1
---
    public function info(int $idVacante){
        if((Auth::check()) && (auth()->user()->privilegio==1)) {
            $vac = Vacantes::where('idVacante', $idVacante)->select()->first();